[
  {
    "id": 1001,
    "title": "Open Doors / Registration",
    "description": "Get your badge, shirt and coffee, enjoy talking with tech addicts around",
    "language": "",
    "complexity": "",
    "presentation": "",
    "video": ""
  },
  {
    "id": 1006,
    "title": "Welcome",
    "description": "Hi",
    "language": "en",
    "complexity": "",
    "presentation": "",
    "video": ""
  },
  {
    "id": 1002,
    "title": "Lunch",
    "description": "Foooooooood!",
    "language": "",
    "complexity": "",
    "presentation": "",
    "video": ""
  },
  {
    "id": 1003,
    "title": "Coffee break",
    "description": "Coffeeeeeee!",
    "language": "",
    "complexity": "",
    "presentation": "",
    "video": ""
  },
  {
    "id": 1004,
    "title": "Closing",
    "description": "Goodbye!",
    "language": "en",
    "complexity": "",
    "presentation": "",
    "video": ""
  },
  {
    "id": 1005,
    "title": "After Party",
    "description": "Beeeeeeeeer!",
    "language": "",
    "complexity": "",
    "presentation": "",
    "video": ""
  },
  {
    "id": 101,
    "title": "There’s an Polymer Element for that — but what if there isn't?",
    "description": "You have your own service. It has a very nice API. Is there Polymer an element for that? Probably not! In this session we’ll talk about patterns that occur when writing your own elements while wrapping an API or while writing new visual elements.",
    "speakers": [1],
    "language": "en",
    "complexity": "Intermediate",
    "presentation": "https://speakerdeck.com/surma/what-if-there-isnt-1",
    "video": "",
    "tags": [
        "Web"
    ]
  },
  {
    "id": 102,
    "title": "stick-to-finger fast 60fps",
    "description": "So our pages load fast now, PageSpeed Insights loves us and we tweeted #perfmatters with pride, but we're not done yet! If we miss our 60fps goal, interacting with websites and -apps can become pure pain - especially on mobile. In this talk I will first explain in short how browsers turn our code into pixels each frame. And with the help of Chrome's DevTools we will make scrolling and transitions jank free without giving up our eye candy features e.g. fixed header, off-canvas menu and parallax scrolling. Let’s create some fancy rich but silky smooth stick-to-finger user experiences!",
    "speakers": [3],
    "language": "en",
    "complexity": "Expert",
    "presentation": "https://speakerdeck.com/kimhogeling/apps-gdg-devfest-hamburg-2015",
    "video": "",
    "tags": [
        "Web"
    ]
  },
  {
    "id": 103,
    "title": "The Web - Today and Tomorrow",
    "description": "The days 'the web' was only static HTML with text and hyperlinks is over for a long time. Frameworks like AngularJS are on the rise (or already hit the top?!). Still there are a lot of modern Web APIs that a lot of (web) developers are not aware of or do not know how to use in a sensible way. This talk shows the potential of the web with its APIs as it is today and the potential it may unleash in the future. The APIs will be demonstrated with a lot of code samples, demo applications and several use-cases from the real world.",
    "speakers": [2],
    "language": "en",
    "complexity": "Intermediate",
    "presentation": "https://www.timroes.de/wp-content/uploads/2015/05/modernweb.pdf",
    "video": "",
    "tags": [
        "Web"
    ]
  },
  {
    "id": 104,
    "title": "Google community ecosystem: we need to go deeper",
    "description": "Curious what Google Top Contributors (TCs), Google Developer Groups (GDGs), Google Business Groups (GBGs), Google Educator Groups (GEGs), Google Experts (incl. GDEs), Google Student Ambassadors (GSAs), Google Map Maker (GMM) editors, Google Local Guides, Google Women Techmakers (WTM), YouTube Creators, and Google Translators are all about? In this session, we’ll talk about 11 various communities around Google’s consumer, developer, and business products and technologies. The goal is to help you to focus on the most relevant communities to you, based on your personal and professional interests.",
    "speakers": [4],
    "language": "en",
    "complexity": "Beginner",
    "presentation": "http://bit.ly/devfesthh",
    "video": "",
    "tags": [
        "Community"
    ]
  },
  {
    "id": 105,
    "title": "Piracy on Android",
    "description": "Building awesome Android apps is a really really hard work that takes tons of time and dedication and also money. The worst thing that can happen to developers is that their apps get pirated and the developers that worked so hard to create them do not get honored for their hard work. This talk will show the problems that arise from pirated apps as well as which countermeasures you, as a developer, can take to make it as difficult as possible to pirate your apps.",
    "speakers": [7],
    "language": "en",
    "complexity": "Intermediate",
    "presentation": "https://docs.google.com/presentation/d/1L49TcEx7xd29UtHMI8CiOvEzCq9D7Xj6GTDdAzMgiVs/edit?usp=sharing",
    "video": "",
    "tags": [
        "Android"
    ]
  },
  {
    "id": 106,
    "title": "#PERFMATTERS for Android",
    "description": "The slogan '#PERFMATTERS' by Colt McAnlis is one of the most important statements, which an Android developer should follow. A well performing application makes the difference between a nice looking application and one, which gets successful. You, as an Android developer, have the responsibility to delight your users, so they don't feel how much work your application has to burden to fulfill the user's needs. This session will show you some easy optimizations and how to avoid glitches in the application. A lot of developers would shout, that this is premature optimization. In contrary it is preventive. With a small amount of work while developing you can avoid a lot of pitfalls. You will hopefully have a better understanding of the underlying system afterwards. During the session some tools and frameworks will be presented for helping you to fulfill your mission.",
    "speakers": [5],
    "language": "en",
    "complexity": "Intermediate",
    "presentation": "https://speakerdeck.com/alosdev/perfmatters-for-android",
    "video": "",
    "tags": [
        "Android"
    ]
  },
  {
    "id": 107,
    "title": "Microservices in Go",
    "description": "Every single developer heard this say more than one time during his professional career, 'KIS' which means 'Keep It Simple', however with the excessive evolvement of the web computing and the continues rise of the distributed systems, the complexity of the systems architecture increases. Building a server enterprise application which is highly scalable with high and reliable availability in addition to great performance which consists of set of independent deployable oriented services can be achieved by Microservice architecture. This session introduces briefly what is the Microservice Architecture and how to build it using one of the most popular server programming languages which is called Go or Golang.",
    "speakers": [8],
    "language": "en",
    "complexity": "Expert",
    "presentation": "http://www.slideshare.net/MoathQassem/microservices-in-golang",
    "video": "",
    "tags": [
        "Cloud"
    ]
  },
  {
    "id": 108,
    "title": "Dagger 2 - Dependency Injection on Android",
    "description": "A lot of developers are talking about Dependency Injection, how cool it is and how fast/great/spectacular a specific Dependency Injection Framework is, but there are not that many good explainations on how to actually implement it. This talk will handle what Dependency Injection is (very short) and how to implement Dependency Injection with Dagger2 on Android. If you are thinking about using a Dependency Injection framework but you are not really sure how to implement it, this is the talk you should join!",
    "speakers": [6],
    "language": "en",
    "complexity": "Intermediate",
    "presentation": "http://andretietz.github.io/dagger2-introduction/",
    "video": "",
    "tags": [
        "Android"
    ]
  },
  {
    "id": 109,
    "title": "Why you want to automate your mobile testing process",
    "description": "Automated Testing nowadays is an essential part of software development and is getting increasingly popular in mobile development. Automating unit tests is quite common these days, however automated UI testing  provides you with more reasonable test results, since it is performed on the same user interface your daily user is confronted with. Integrating automated UI testing into your daily business enables you to detect problems in software early on, which provides you with permanent control over an ongoing development process. Furthermore automated UI testing allows you to speed up your development cycle which will lead to swifter detection of regressions in development and therefore helps to lower the overall cost of software development. This session aims to introduce the audience to the field of automated testing by giving a short overview of this particular subject and some useful tools. It takes a critical look at the status quo, the benefits and possible complications of automated testing.",
    "speakers": [9],
    "language": "en",
    "complexity": "Intermediate",
    "presentation": "https://slidr.io/Maikeeefer/why-you-should-automate-your-mobile-testing-process#1",
    "video": "",
    "tags": [
        "Android"
    ]
  },
  {
    "id": 110,
    "title": "Recipe for a successful App Business",
    "description": "With thousands of apps being published in the apps stores daily, how can you make sure your app is standing out? This talk will provide you with tips, tools and insights on how to capture more, engaged & loyal users and help you build and grow a successful apps business.",
    "speakers": [10],
    "language": "en",
    "complexity": "Beginner",
    "presentation": "https://drive.google.com/file/d/0B5fLjsud2Jw0bTZKTHhVbHFOQjA/view?usp=sharing",
    "video": "",
    "tags": [
        "Android"
    ]
  },
  {
    "id": 111,
    "title": "Containers at Google (and Kubernetes)",
    "description": "Google has been using Container-Technologies for a long time. After a brief dive into the history of container technologies at Google the talk covers what is now possible with Docker containers on Google Cloud Platform, talking about App Engine, Kubernetes and the Google Container Engine.",
    "speakers": [11],
    "language": "en",
    "complexity": "Beginner",
    "presentation": "",
    "video": "",
    "tags": [
        "Cloud"
    ]
  },
  {
    "id": 112,
    "title": "Responsive Testing with Galen",
    "description": "It’s a pain for testers and developers. Running an application with different browsers. Resize the browser window and verify that the web page is working on different screen size. Due to “Responsive Design” there are high efforts on this kind of stuff.<br><br>Sure it’s possible to calculate the delta between images to ensure that the layout does not differ between the last checks. But especially when you build up a new application or start a new design this approach doesn’t really work out. Here comes the Galen Framework to the rescue: Describe like in TDD you’re requirements in a DSL and let the framework verify it for you. The Galen DSL uses relations between elements to describe your checks. For test execution the Selenium automation stack is used. So you can even utilize Saucelabs. And the  Galen Framework can be used in Java– und JavaScript projects. Additionally Galen delivers impressive reports for analyzing the failures.",
    "speakers": [13],
    "language": "en",
    "complexity": "Intermediate",
    "presentation": "http://sokahh.github.io/presentations/galen_google-dev-fest-2015",
    "video": "",
    "tags": ["Web"]
  },
  {
    "id": 113,
    "title": "The Android 'Data Binding Library' - Don't be scared of your XMLs!",
    "description": "At Google I/O 2015 Google came out and announced the 'Data Binding Library' for Android. It wants to put 'code' into your XMLs. And that isn't necessarily a bad thing! While still in Beta, there are already many interesting points to take away from this Library that show us that Google does indeed care about the architecture in your apps!<br><br>This talk will show you how the Data Binding Library works and how you can work with it. We will see how to use it and take a look into the land of generated code to see what powers the library internally.",
    "speakers": [12],
    "language": "en",
    "complexity": "Beginner",
    "presentation": "https://mauin.github.io/DevFestDatabinding/#/",
    "video": "",
    "tags": [
        "Android"
    ]
  },
  {
    "id": 114,
    "title": "Embracing the OK stack - A non-Square perspective",
    "description": "Nowadays, its all about performance. We struggle to get our apps faster, smarter and less greedy when it comes to battery and data consumption. And don't forget all this has to be shipped in a nice and tiny package (I'm talking about you DEX limit). With so much jibber-jabber about what is good for you and what you should fear, as if it was pure poison, in this wasteland of false streams and broken connections there is hope to make things OK. This talk is about how to make the right decision when developing the data and network layers for your app(s). We will dive into the core of modern high and low level HTTP clients such as Retrofit and OkHttp. And see what makes them so efficient and why the OK stack is the right choice for you, no matter if you are writing a messaging app or designing a public sdk.",
    "speakers": [14],
    "language": "en",
    "complexity": "Intermediate",
    "presentation": "",
    "video": "",
    "tags": [
        "Android"
    ]
  },

  {
   "id": 2001,
    "title": "Open Doors / Registration",
    "description": "Get your badge and shirt, enjoy talking with tech addicts around",
    "language": "en",
    "complexity": "Beginner",
    "presentation": "",
    "video": ""
  },
  {
    "id": 2002,
    "title": "Welcome / Codelab Overview",
    "description": "Short intro to all the planned codelabs",
    "language": "en",
    "complexity": "",
    "presentation": "",
    "video": ""
  },
  {
    "id": 201,
    "title": "CODELAB: Polymer",
    "description": "Building applications declaratively, enables composition of components to form a business specific applications, that require almost no code.<br><br>This Codelab will help you building your first Polymer application and integrate existing APIs to form a complex web application. At first a short introduction into Polymer is given with a glimpse of what can be dome with it – not just building for the Web but for Mobile and Desktop.<br><br>To get started as fast as possible, each participant should have Git, Node.js, NPM and Bower installed. A good starting point is the Polymer-Starter-Kit (PSK) [1], which demonstrates how Polymer-Applications are structured, build and tested.<br><br>[1] https://github.com/PolymerElements/polymer-starter-kit",
    "speakers": [16],
    "language": "en",
    "complexity": "Beginner",
    "presentation": "",
    "video": "",
    "tags": [
        "Web"
    ]
  },
  {
    "id": 202,
    "title": "CODELAB: Gradle Quick Start",
    "description": "Gradle bekommt als Buildtool einen immer größeren Stellenwert. Das liegt u.a. daran, dass der Einsatz von Gradle im Kontext der Android-Entwicklung immer beliebter wird.<br><br>Wir werfen hier einen ersten Blick auf Gradle und gehen gemeinsam die ersten Schritte mit Gradle, um dessen Anwendung zu verstehen. Erfahrung mit Gradle ist nicht nötig. Das Codelab richtet sich explizit an Einsteiger. Der Einsatz von Gradle bei der Android-Entwicklung wird ebenfalls nicht betrachtet.",
    "speakers": [15],
    "language": "de",
    "complexity": "Beginner",
    "presentation": "",
    "video": "",
    "tags": [
        "Android"
    ]
  },
  {
    "id": 203,
    "title": "CODELAB: Google AppEngine with Python",
    "description": "TBA",
    "speakers": [17],
    "language": "en",
    "complexity": "Beginner",
    "presentation": "",
    "video": "",
    "tags": [
        "Cloud"
    ]
  },
  {
    "id": 204,
    "title": "CODELAB: Hands-on Performance - Eine Einführung in Web Performance",
    "description": "Performance Matters: Eine schnell ladende Website ist nicht nur für eine optimale User Experience - auch in langsamen Mobilfunknetzen - sondern auf für SEO wichtig. Doch wie gut steht die eigene Site da? Begleitet Frank, Jan und Oliver dabei, wenn sie  schnell und mit einfachen Mitteln Bottlenecks in Websites suchen.<br><br>Dieser Workshop fokussiert sich auf Tools zur Web Performance-Analyse (Google Chrome Dev Tools, Google PageSpeed Insights, WebPagetest), die jeder Teilnehmer selbst ausprobieren wird. Ein Notebook mit installiertem Google Chrome-Browser und eine Internetverbindung sind daher Voraussetzung für die Teilnahme an diesem Workshop.",
    "speakers": [20, 21, 22],
    "language": "de",
    "complexity": "Beginner",
    "presentation": "",
    "video": "",
    "tags": [
        "Web"
    ]
  },
  {
    "id": 205,
    "title": "CODELAB: Building a Material Design App",
    "description": "Material design is a comprehensive guide for visual, motion, and interaction design across platforms and devices. In this codelab, you’ll learn the principles of this design language by building a sample Android app.<br><br>What you’ll learn<br>- How to use the Android Design Support Library.<br>- How to apply material design to your Android app.<br>- The following key material design components and principles:<br>&emsp;- Themes and colors to create tangible surfaces and print-like design<br>&emsp;- App layout best practices for improved navigability<br>&emsp;- Animation and touch feedback to express meaningful motion.<br><br>What you’ll need<br>- Android Studio [1] version 1.4+ and JDK 7+ [2]<br>- Experience developing Android Apps<br>- A test device with Android 4.1+<br>- A USB micro to USB cable.<br><br>Android devices running Android 2.3.3 (Gingerbread, API Level 10) or higher may be used, however, some material design effects, such as the ripple effect, will not be visible on devices running on Android 4.4 (KitKat) or before.<br><br>[1] https://developer.android.com/sdk/installing/studio.html<br>[2] http://www.oracle.com/technetwork/java/javase/downloads/jdk7-downloads-1880260.html",
    "speakers": [18],
    "language": "en",
    "complexity": "Beginner",
    "presentation": "http://www.code-labs.io/codelabs/material-design-style/index.html",
    "video": "",
    "tags": [
        "Android"
    ]
  },
  {
    "id": 206,
    "title": "CODELAB: Golang (Part I)",
    "description": "",
    "speakers": [23],
    "language": "DE",
    "complexity": "Beginner",
    "presentation": "",
    "video": "",
    "tags": [
        "Cloud"
    ]
  },
  {
    "id": 207,
    "title": "CODELAB: Dagger 2",
    "description": "Getting started on Dependency Injection with Dagger2 isn't that easy for everyone.<br><br>In this codelab we'll guide you step by step to your first project running with dagger2. Starting with setting up the libraries, up until using dagger2 in a small example project we set up.<br><br>You should know, what dagger2 is and what you would use it for. Bring your Laptop and since we're limited on time, you should have your Android Studio up and running already.",
    "speakers": [6, 24],
    "language": "en",
    "complexity": "Intermediate",
    "presentation": "",
    "video": "",
    "tags": [
        "Android"
    ]
  },
  {
    "id": 208,
    "title": "CODELAB: Talking with Eddystone Beacons using Google’s Nearby API",
    "description": "Earlier this year Google announced their system for talking to nearby beacons. Along with this system, they also introduced a format in which this beacons communicate with their environment, Eddystone. These two components play quite nicely with each other, which is why combining them makes sense. Using the Nearby API, your Android or iOS app can then detect nearby beacons and use your attachments to deliver users a magical proximity-aware experience.<br><br>In this Codelab we will explore Google’s Nearby API to talk to some Eddystone beacons and see what possible use cases for this technology exist.",
    "speakers": [19],
    "language": "en",
    "complexity": "Intermediate",
    "presentation": "",
    "video": "",
    "tags": [
        "Android"
    ]
  },
  {
    "id": 209,
    "title": "CODELAB: Golang (Part II)",
    "description": "",
    "speakers": [23],
    "language": "DE",
    "complexity": "Beginner",
    "presentation": "",
    "video": "",
    "tags": [
        "Cloud"
    ]
  }
]