[
  {
    "id": 101,
    "title": "There’s an Polymer Element for that — but what if there isn't?",
    "description": "You have your own service. It has a very nice API. Is there Polymer an element for that? Probably not! In this session we’ll talk about patterns that occur when writing your own elements while wrapping an API or while writing new visual elements.",
    "speakers": [1],
    "language": "en",
    "complexity": "Intermediate",
    "presentation": "",
    "video": ""
  },
  {
    "id": 102,
    "title": "stick-to-finger fast 60fps",
    "description": "So our pages load fast now, PageSpeed Insights loves us and we tweeted #perfmatters with pride, but we're not done yet! If we miss our 60fps goal, interacting with websites and -apps can become pure pain - especially on mobile. In this talk I will first explain in short how browsers turn our code into pixels each frame. And with the help of Chrome's DevTools we will make scrolling and transitions jank free without giving up our eye candy features e.g. fixed header, off-canvas menu and parallax scrolling. Let’s create some fancy rich but silky smooth stick-to-finger user experiences!",
    "speakers": [3],
    "language": "en",
    "complexity": "Expert",
    "presentation": "",
    "video": ""
  },
  {
    "id": 103,
    "title": "The Web - Today and Tomorrow",
    "description": "The days 'the web' was only static HTML with text and hyperlinks is over for a long time. Frameworks like AngularJS are on the rise (or already hit the top?!). Still there are a lot of modern Web APIs that a lot of (web) developers are not aware of or do not know how to use in a sensible way. This talk shows the potential of the web with its APIs as it is today and the potential it may unleash in the future. The APIs will be demonstrated with a lot of code samples, demo applications and several use-cases from the real world.",
    "speakers": [2],
    "language": "en",
    "complexity": "Intermediate",
    "presentation": "",
    "video": ""
  },
  {
    "id": 104,
    "title": "Google community ecosystem: we need to go deeper",
    "description": "Curious what Google Top Contributors (TCs), Google Developer Groups (GDGs), Google Business Groups (GBGs), Google Educator Groups (GEGs), Google Experts (incl. GDEs), Google Student Ambassadors (GSAs), Google Map Maker (GMM) editors, Google Local Guides, Google Women Techmakers (WTM), YouTube Creators, and Google Translators are all about? In this session, we’ll talk about 11 various communities around Google’s consumer, developer, and business products and technologies. The goal is to help you to focus on the most relevant communities to you, based on your personal and professional interests.",
    "speakers": [4],
    "language": "en",
    "complexity": "Beginner",
    "presentation": "",
    "video": ""
  },
  {
    "id": 105,
    "title": "Piracy on Android",
    "description": "Building awesome Android apps is a really really hard work that takes tons of time and dedication and also money. The worst thing that can happen to developers is that their apps get pirated and the developers that worked so hard to create them do not get honored for their hard work. This talk will show the problems that arise from pirated apps as well as which countermeasures you, as a developer, can take to make it as difficult as possible to pirate your apps.",
    "speakers": [7],
    "language": "en",
    "complexity": "Intermediate",
    "presentation": "",
    "video": ""
  },
  {
    "id": 106,
    "title": "#PERFMATTERS for Android",
    "description": "The slogan '#PERFMATTERS' by Colt McAnlis is one of the most important statements, which an Android developer should follow. A well performing application makes the difference between a nice looking application and one, which gets successful. You, as an Android developer, have the responsibility to delight your users, so they don't feel how much work your application has to burden to fulfill the user's needs. This session will show you some easy optimizations and how to avoid glitches in the application. A lot of developers would shout, that this is premature optimization. In contrary it is preventive. With a small amount of work while developing you can avoid a lot of pitfalls. You will hopefully have a better understanding of the underlying system afterwards. During the session some tools and frameworks will be presented for helping you to fulfill your mission.",
    "speakers": [5],
    "language": "",
    "complexity": "",
    "presentation": "",
    "video": ""
  },
  {
    "id": 107,
    "title": "Microservices in Go",
    "description": "Every single developer heard this say more than one time during his professional career, 'KIS' which means 'Keep It Simple', however with the excessive evolvement of the web computing and the continues rise of the distributed systems, the complexity of the systems architecture increases. Building a server enterprise application which is highly scalable with high and reliable availability in addition to great performance which consists of set of independent deployable oriented services can be achieved by Microservice architecture. This session introduces briefly what is the Microservice Architecture and how to build it using one of the most popular server programming languages which is called Go or Golang.",
    "speakers": [8],
    "language": "en",
    "complexity": "Expert",
    "presentation": "",
    "video": ""
  },
  {
    "id": 108,
    "title": "Dagger 2 - Dependency Injection on Android",
    "description": "",
    "speakers": [6],
    "language": "en",
    "complexity": "",
    "presentation": "",
    "video": ""
  }
]
